ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32L43x/N32L433.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device
    schemaVersion="1.3"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
    xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>Nationstech Ltd.</vendor>
    <vendorID>NS</vendorID>
    <name>N32L433</name>
    <version>1.0</version>
    <description>N32L433</description>

    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0</resetValue>
    <resetMask>0xffffffff</resetMask>

    <peripherals>
        <peripheral>
            <name>ADC</name>
            <description>analog to digital converter</description>
            <groupName>ADC</groupName>
            <baseAddress>0x40020800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADC</name>
                <description>ADC global interrupt</description>
                <value>19</value>
            </interrupt>
            <registers>
                <register>
                    <name>ADC_STS</name>
                    <displayName>ADC_STS</displayName>
                    <description>ADC_STS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007f</resetMask>
                    <fields>
                        <field>
                            <name>AWDG</name>
                            <description>AWDG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENDC</name>
                            <description>ENDC</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JENDC</name>
                            <description>JENDC</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JSTR</name>
                            <description>JSTR</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STR</name>
                            <description>STR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENDCA</name>
                            <description>ENDCA</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JENDCA</name>
                            <description>JENDCA</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_CTRL1</name>
                    <displayName>ADC_CTRL1</displayName>
                    <description>ADC_CTRL1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00ffffff</resetMask>
                    <fields>
                        <field>
                            <name>AWDGCH</name>
                            <description>AWDGCH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ENDIEN</name>
                            <description>ENDIEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDGIEN</name>
                            <description>AWDGIEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JENDCIEN</name>
                            <description>JENDCIEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCANMD</name>
                            <description>SCANMD</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDGSGLEN</name>
                            <description>AWDGSGLEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AUTOJC</name>
                            <description>AUTOJC</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DREGCH</name>
                            <description>DREGCH</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DJCH</name>
                            <description>DJCH</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTU</name>
                            <description>DTU</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>AWDGEJCH</name>
                            <description>AWDGEJCH</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDGERCH</name>
                            <description>AWDGERCH</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_CTRL2</name>
                    <displayName>ADC_CTRL2</displayName>
                    <description>ADC_CTRL2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00fef907</resetMask>
                    <fields>
                        <field>
                            <name>ON</name>
                            <description>ON</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTU</name>
                            <description>CTU</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENCAL</name>
                            <description>ENCAL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENDMA</name>
                            <description>ENDMA</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALIG</name>
                            <description>ALIG</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTJSEL</name>
                            <description>EXTJSEL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>EXTJTRIG</name>
                            <description>EXTJTRIG</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTRSEL</name>
                            <description>EXTRSEL</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>EXTRTRIG</name>
                            <description>EXTRTRIG</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWSTRJCH</name>
                            <description>SWSTRJCH</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWSTRRCH</name>
                            <description>SWSTRRCH</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEMPEN</name>
                            <description>TEMPEN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_SMPR1</name>
                    <displayName>ADC_SMPR1</displayName>
                    <description>ADC_SMPR1</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00ffffff</resetMask>
                    <fields>
                        <field>
                            <name>SAMP10</name>
                            <description>SAMP10</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP11</name>
                            <description>SAMP11</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP12</name>
                            <description>SAMP12</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP13</name>
                            <description>SAMP13</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP14</name>
                            <description>SAMP14</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP15</name>
                            <description>SAMP15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP16</name>
                            <description>SAMP16</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP17</name>
                            <description>SAMP17</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_SMPR2</name>
                    <displayName>ADC_SMPR2</displayName>
                    <description>ADC_SMPR2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3fffffff</resetMask>
                    <fields>
                        <field>
                            <name>SAMP0</name>
                            <description>SAMP0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP1</name>
                            <description>SAMP1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP2</name>
                            <description>SAMP2</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP3</name>
                            <description>SAMP3</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP4</name>
                            <description>SAMP4</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP5</name>
                            <description>SAMP5</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP6</name>
                            <description>SAMP6</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP7</name>
                            <description>SAMP7</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP8</name>
                            <description>SAMP8</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SAMP9</name>
                            <description>SAMP9</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JOFFSET1</name>
                    <displayName>ADC_JOFFSET1</displayName>
                    <description>ADC_JOFFSET1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>OFFSETJCH2</name>
                            <description>OFFSETJCH2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JOFFSET2</name>
                    <displayName>ADC_JOFFSET2</displayName>
                    <description>ADC_JOFFSET2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>OFFSETJCH2</name>
                            <description>OFFSETJCH2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JOFFSET3</name>
                    <displayName>ADC_JOFFSET3</displayName>
                    <description>ADC_JOFFSET3</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>OFFSETJCH3</name>
                            <description>OFFSETJCH3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JOFFSET4</name>
                    <displayName>ADC_JOFFSET4</displayName>
                    <description>ADC_JOFFSET4</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>OFFSETJCH4</name>
                            <description>OFFSETJCH4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_WDGHIGH</name>
                    <displayName>ADC_WDGHIGH</displayName>
                    <description>ADC_WDGHIGH</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>HTH</name>
                            <description>HTH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_WDGLOW</name>
                    <displayName>ADC_WDGLOW</displayName>
                    <description>ADC_WDGLOW</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>LTH</name>
                            <description>LTH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
